export const degree = {
  // 学历 1----初中及以下，2---中专/中技，3---高中，4---大专，5---本科，6---硕士，7---博士
  '1': '初中及以下',
  '2': '中专/中技',
  '3': '高中',
  '4': '大专',
  '5': '本科',
  '6': '硕士',
  '7': '博士'
}

export const schoolType = {
  // 学校类型，1---全日制，2---非全日制
  '1': '全日制',
  '2': '非全日制'
}

export const companySize = {
  // 公司规模（少于15人 15-50人 50-150人 150-500人 500-2000人 2000人以上）
  '1': '少于15人',
  '2': '15-50人',
  '3': '50-150人',
  '4': '150-500人',
  '5': '500-2000人',
  '6': '2000人以上'
}

export const financing = {
  // 融资阶段（未融资 天使轮 A轮 B轮 C轮 D轮及以上 上市公司 不需要融资）
  '1': '未融资',
  '2': '天使轮',
  '3': 'A轮',
  '4': 'B轮',
  '5': 'C轮',
  '6': 'D轮及以上',
  '7': '上市公司',
  '8': '不需要融资'
}

export const status = {
  // 状态 0-封禁 1-正常
  '0': '封禁',
  '1': '正常'
}

export const gender = {
  // 性别 1-男 2-女
  '1': '男',
  '2': '女'
}

export const auth = {
  // 是否已认证，0---禁用（账号被禁用），1---是，2---否(账号正常)，
  // 3---拒绝 4---企业用户待认证 ,5---企业账号待认证（求职者注册默认为2，企业账号注册默认为5）
  '0': '禁用',
  '1': '通过认证',
  '2': '正常（未认证）',
  '3': '拒绝认证',
  '4': '企业用户待认证',
  '5': '企业账号待认证'
}